01.Importing libraries

In [3]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

02.Importing data

In [5]:
path = r'/Users/tiaoshrieh/Desktop/IC Project'

In [15]:
orders_products_merged = pd.read_pickle(os.path.join(path, '02 Data', 'prepared data', 'orders_products_merged_final.pkl'))

In [6]:
customers = pd.read_csv(os.path.join(path, '02 Data', 'original data', 'customers.csv'))

In [6]:
customers.shape

(206209, 10)

In [7]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

03. Data wrangling

In [7]:
customers_new = customers.drop(columns = ['First Name', 'Surnam'])

In [9]:
customers_new

,user_id,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...,...
206204,168073,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Female,California,27,4/1/2020,1,married,99799
206208,80148,Female,New York,55,4/1/2020,1,married,57095

In [8]:
customers_new = customers_new.rename(columns = { 'Gender' : 'gender', 'STATE' : 'state', 'Age': 'age', 'n_dependants': 'number_of_dependents', 'fam_status': 'family_status'})

In [9]:
customers_new.head()

,user_id,gender,state,age,date_joined,number_of_dependents,family_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [12]:
customers_new['user_id'].astype('str')

0          26711
1          33890
2          65803
3         125935
4         130797
           ...
206204    168073
206205     49635
206206    135902
206207     81095
206208     80148
Name: user_id, Length: 206209, dtype: object

04.Consistency check

In [10]:
customers_new.describe()

             user_id            age  number_of_dependents         income
count  206209.000000  206209.000000         206209.000000  206209.000000
mean   103105.000000      49.501646              1.499823   94632.852548
std     59527.555167      18.480962              1.118433   42473.786988
min         1.000000      18.000000              0.000000   25903.000000
25%     51553.000000      33.000000              0.000000   59874.000000
50%    103105.000000      49.000000              1.000000   93547.000000
75%    154657.000000      66.000000              3.000000  124244.000000
max    206209.000000      81.000000              3.000000  593901.000000

In [11]:
customers_new.isnull().sum()

user_id                 0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependents    0
family_status           0
income                  0
dtype: int64

In [12]:
customers_new[customers_new.duplicated()]

Empty DataFrame
Columns: [user_id, gender, state, age, date_joined, number_of_dependents, family_status, income]
Index: []

In [13]:
for col in customers_new.columns.tolist():
  weird = (customers_new[[col]].applymap(type) != customers_new[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers_new[weird]) > 0:
    print (col)

No mixed-type data

In [14]:
customers_new.shape

(206209, 8)

05.Combining datasets

In [17]:
orders_products_merged['user_id'].dtype

dtype('int64')

In [16]:
orders_products_merged['user_id'].astype('str')

0              138
1              138
2              709
3              764
4              764
             ...
32404854    200215
32404855    200377
32404856    200873
32404857    200873
32404858    205926
Name: user_id, Length: 32404859, dtype: object

In [17]:
all_merged = customers_new.merge(orders_products_merged, on = 'user_id')

In [18]:
all_merged.shape

(32404859, 32)

In [93]:
all_merged = all_merged.drop(columns = ['Unnamed: 0'])

In [94]:
all_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_customers.pkl'))

In [21]:
crosstab = pd.crosstab(orders_products_merged['days_since_prior_order'], orders_products_merged['order_number'], dropna = False)

In [22]:
crosstab.to_clipboard()